Tekla.Structures.Model.Operations.Operation.CreateReportFromSelected(System.String,System.String,System.String,System.String,System.String)
Creates a report from the selected objects using the given template name and filename.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
See Tekla Structures Help for more information about reports.
TemplateName: The name of the report template to be used in report creation. The name must contain more than three characters.
FileName: The name of the created report. The name must contain more than three characters.
Title1: The first title for the created report.
Title2: The second title for the created report.
Title3: The third title for the created report.
Throws System.ArgumentNullException: Thrown when the TemplateName or FileName is null.
Throws System.ArgumentException: Thrown when the TemplateName or FileName is too short.
Returns: True if the report is created.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Model Model = new Model();
Beam B = new Beam(new Point(0,0,0), new Point(0,0,6000));
Beam B1 = new Beam(new Point(0,1000,0), new Point(0,1000,6000));
Beam B2 = new Beam(new Point(0,2000,0), new Point(0,2000,6000));
B.Insert();
B1.Insert();
B2.Insert();
ArrayList ObjectsToSelect = new ArrayList();
ObjectsToSelect.Add(B);
ObjectsToSelect.Add(B2);
Model.CommitChanges();
Tekla.Structures.Model.UI.ModelObjectSelector ModelSelector = new Tekla.Structures.Model.UI.ModelObjectSelector();
ModelSelector.Select(ObjectsToSelect);
Operation.CreateReportFromSelected("Assembly_list", "Assembly_list_selected.xsr", "MyTitle", "", "");
Operation.DisplayReport("Assembly_list_selected.xsr");
}
}

Tekla.Structures.Model.Operations.Operation.DisplayReport(System.String)
Opens and displays a report with the given name.
If a path is not given in the filename, the file is searched from the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
See Tekla Structures Help for more information about reports.
FileName: The name of the report to display. The name must contain more than three characters.
Throws System.ArgumentException: Thrown when the file specified in the FileName is not found or when the FileName is too short.
Returns: True if the report existed.

Tekla.Structures.Model.Operations.Operation.CreateReportFromAll(System.String,System.String,System.String,System.String,System.String)
Creates a report from all the objects using the given template name and filename.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
Internally, this method is asynchronous, and because of that the output file cannot be immediately available.
See Tekla Structures Help for more information about reports.
TemplateName: The name of the report template to be used in report creation. The name must contain more than three characters.
FileName: The name of the created report. The name must contain more than three characters.
Title1: The first title for the created report.
Title2: The second title for the created report.
Title3: The third title for the created report.
Throws System.ArgumentNullException: Thrown when the TemplateName or FileName is null.
Throws System.ArgumentException: Thrown when the TemplateName or FileName is too short.
Returns: True if the report is created.
The following example creates a report and then displays it. It is taken into account that the created file might not be immediately available.
using System.IO;
using System.Threading;
using Tekla.Structures.Model.Operations;
public class Example
{
public bool IfLockedWait(string FileName)
{
// try 10 times
int RetryNumber = 10;
while (true)
{
try
{
using(FileStream FileStream = new FileStream(
FileName, FileMode.Open,
FileAccess.ReadWrite, FileShare.ReadWrite))
{
byte[] ReadText = new byte[FileStream.Length];
FileStream.Seek(0, SeekOrigin.Begin);
FileStream.Read(ReadText, 0, (int)FileStream.Length);
}
return true;
}
catch (IOException)
{
// wait one second
Thread.Sleep(1000);
RetryNumber--;
if(RetryNumber == 0)
return false;
}
}
}
public void Example1()
{
Operation.CreateReportFromAll("Assembly_list", "Assembly_list.xsr", "MyTitle", "", "");
if(File.Exists("Assembly_list.xsr"))
{
// wait until Tekla Structures has unlocked the file, or timeout
if(IfLockedWait("Assembly_list.xsr"))
{
// display the report
Operation.DisplayReport("Assembly_list.xsr");
}
}
}
}

Tekla.Structures.Model.Operations.Operation.CreateIFC4ExportFromSelected(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String)
Creates IFC4 export from the selected parts using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
propertySets: The full path and file name of the property set files (.xml) to use in export.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create an Ifc4 for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
var fullPathAndFileName = @"C:\Export\MyIfc.ifc";
var exportViewType = Operations.Operation.IFCExportViewTypeEnum.REFERENCE_VIEW;
var propertySets = new List<string> { @"..\\default\\General\\Shared\\IFC\\AdditionalPSets\\CIP Construction data.xml" };
var locationByValue = Operations.Operation.ExportBasePoint.GLOBAL;
var exportLayersAsValue =  "__Name__";
var objectColoring = "standard";
var flags = new Operations.Operation.IFCExportFlags { IsLocationFromOrganizer = true, IsPoursEnabled = true };
var basePointGuid = string.Empty;
if (Operation.CreateIFC4ExportFromSelected(fullPathAndFileName, exportViewType, propertySets, locationByValue, exportLayersAsValue, objectColoring, flags, basePointGuid))
{
MessageBox.Show("Ifc4 export creation successful");
}
MOS.Select(new ArrayList()); // Remove UI selection
}
}

Tekla.Structures.Model.Operations.Operation.CreateIFC4ExportFromAll(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String)
Creates IFC4 export from all objects using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
propertySets: The full path and file name of the property set files (.xml) to use in export.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
public void Example1()
{
var fullPathAndFileName = @"C:\Export\MyIfc.ifc";
var exportViewType = Operations.Operation.IFCExportViewTypeEnum.REFERENCE_VIEW;
var propertySets = new List<string> { @"..\\default\\General\\Shared\\IFC\\AdditionalPSets\\CIP Construction data.xml" };
var locationByValue = Operations.Operation.ExportBasePoint.GLOBAL;
var exportLayersAsValue =  "__Name__";
var objectColoring = "ByObjectClass";
var flags = new Operations.Operation.IFCExportFlags { IsLocationFromOrganizer = true, IsPoursEnabled = true };
var basePointGuid = string.Empty;
if (Operation.CreateIFC4ExportFromAll(fullPathAndFileName, exportViewType, propertySets, locationByValue, exportLayersAsValue, objectColoring, flags, basePointGuid))
{
MessageBox.Show("Ifc4 export creation successful");
}
}
}

Tekla.Structures.Model.Operations.Operation.ExplodeBentPlate(Tekla.Structures.Model.BentPlate)
Deletes bentPlate and inserts Tekla.Structures.Model.ContourPlates instances
equivalent to the ones used to create bentPlate.
The Tekla.Structures.Model.ContourPlate created from the main polygon has the same identifier as bentPlate.
bentPlate: the Tekla.Structures.Model.BentPlate instance to explode.
Throws System.ArgumentException: Thrown when bentPlate is invalid.

Tekla.Structures.Model.Operations.Operation.AddToPourUnit(Tekla.Structures.Model.PourUnit,System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Adds model objects as part of a pour unit
Model object types accepted are assembly types except cast in situ,
reinforcements of different kind, components and bolts
inputPourUnit: the instance of pour unit to add objects to.
objectsToBeAdded: the list of model objects to be added.
Throws System.ArgumentException: Throw exceptions if Pour or object has invalid ID,
do not exist in model or not valid object type.
The following example shows how to add all rebar groups in a model to a pour unit defined by the pour GUID.
You will have to replace the curly braces for the List with lesser and greater than signs.
using System.Collections.Generic;
using Tekla.Structures.Model;
public class Example
{
public void ExampleAddAllRebarGroupsToPour(Guid pourUnitGuid)
{
var Model = new Model();
ModelObjectEnumerator PourEnumerator =
Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.POUR_UNIT);
PourUnit pour = null;
if(PourEnumerator.GetSize() > 0)
{
while(PourEnumerator.MoveNext())
{
var curPour = PourEnumerator.Current as PourUnit;
if(curPour != null)
{
if(curPour.Identifier.GUID == pourUnitGuid)
{
pour = curPour;
break;
}
}
}
}
if(pour != null)
{
var rebarGroupList = new List{ModelObject}();
ModelObjectEnumerator ObjectEnumerator =
Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.REBARGROUP);
if(ObjectEnumerator.GetSize() > 0)
{
while(ObjectEnumerator.MoveNext())
{
var rebargroup = ObjectEnumerator.Current as RebarGroup;
if(rebargroup != null)
{
rebarGroupList.Add(rebargroup);
}
}
}
if (rebarGroupList.Count() > 0)
{
try
{
AddToPourUnit(pour, rebarGroupList);
}
catch (ArgumentException ex)
{
var DoSomethingWithThisEx = ex;
}
}
}
}
}

Tekla.Structures.Model.Operations.Operation.RemoveFromPourUnit(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Removes model object from pour unit
Model object types accepted are assembly types except cast in situ,
reinforcements of different kind, components and bolts
objectsToBeRemoved: the list of model objects to be added.
Throws System.ArgumentException: Throw exceptions if object has invalid ID,
do not exist in model or not valid object type.
The following example shows how to remove one rebar group from the pour unit.
You will have to replace the curly braces for the List with lesser and greater than signs.
using System.Collections.Generic;
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
public void ExampleRemoveRebarGroupFromPour(Guid rebarGroupGuid)
{
var Model = new Model();
ModelObjectEnumerator ObjectEnumerator =
Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.REBARGROUP);
RebarGroup rebarGroup = null;
bool bFound = false;
if(ObjectEnumerator.GetSize() > 0)
{
while(ObjectEnumerator.MoveNext())
{
rebarGroup = ObjectEnumerator.Current as RebarGroup;
if(rebarGroup != null)
{
if(rebarGroup.Identifier.GUID == rebarGroupGuid)
{
bFound = true;
break;
}
}
}
}
if(bFound)
{
var objectsToRemove = new List{ModelObject}() { rebarGroup };
RemoveFromPourUnit(objectsToRemove);
}
}
}

Tekla.Structures.Model.Operations.Operation.CalculatePourUnits
Calculate and assign objects to pour unit
Model object types that are associated with pour unit are assembly types except cast in situ,
reinforcements of different kind, components and screws